app/controllers/infos_controller.rb

    def index
    @infos= Info.all
---
SELECT "infos".* FROM "infos"

    def create
         @infos = Info.new(infos_params)
    if @infos.save
---
INSERT INTO "infos" ("fname", "lname", "email", "age", "degree", "passing_year", "company", "website", "add1", "add2", "city", "state", "pincode", "password", "user_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def edit
        @infos = Info.find(params[:id])
---
SELECT "infos".* FROM "infos" WHERE "infos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def update
        @infos = Info.find(params[:id])
        if @infos.update(infos_params)
---
SELECT "infos".* FROM "infos" WHERE "infos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "infos" SET "email" = ?, "updated_at" = ? WHERE "infos"."id" = ?  [["email", "laxmichauhan12@gmail.com"], ["updated_at", "2020-01-29 05:25:41.252216"], ["id", 5]]

    def destroy
        @infos = Info.find(params[:id])
        @infos.destroy
---
SELECT "infos".* FROM "infos" WHERE "infos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "infos" WHERE "infos"."id" = ?  [["id", 4]]